TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НастройкиНазначенияРазгрузки/гкс_НастройкиНазначенияРазгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_НастройкиНазначенияРазгрузки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Силос</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </resources>
  <resources>
    <name>ЯмаРазгрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </resources>
  <resources>
    <name>ТочкаВъезда</name>
    <comment>Точка въезда</comment>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </resources>
  <resources>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <comment>ERP-1377</comment>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СлужебнаяНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ДополнительныеНастройкиНазначенияРазгрузки/гкс_ДополнительныеНастройкиНазначенияРазгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ДополнительныеНастройкиНазначенияРазгрузки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТочкаВъезда</name>
    <comment>Точка въезда</comment>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </resources>
  <resources>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <comment>ERP-1377</comment>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СлужебнаяНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Силос</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЯмаРазгрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипРегистрации/гкс_ТипРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипРегистрации</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияРегистрации/гкс_СостоянияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияРегистрации</name>
  <enumValues>
    <name>Прибыл</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенБрутто</name>
  </enumValues>
  <enumValues>
    <name>НеПринятоПоПревышениюМаксимальногоВеса</name>
  </enumValues>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтборуПроб</name>
  </enumValues>
  <enumValues>
    <name>ВзятыПробы</name>
  </enumValues>
  <enumValues>
    <name>РезультатыПробПолучены</name>
  </enumValues>
  <enumValues>
    <name>КачествоПринято</name>
  </enumValues>
  <enumValues>
    <name>КачествоНеПринято</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаРазрешена</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенТара</name>
  </enumValues>
  <enumValues>
    <name>Убыл</name>
  </enumValues>
  <enumValues>
    <name>НеПринято</name>
  </enumValues>
  <enumValues>
    <name>ПринятыПробы</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаРазрешена</name>
    <comment>ERP-2029</comment>
  </enumValues>
  <enumValues>
    <name>Погружен</name>
    <comment>ERP-2029</comment>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ЛабораторныйАнализ/гкс_ЛабораторныйАнализ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ЛабораторныйАнализ</name>
  <registerRecords>AccumulationRegister.гкс_ЗаданияНаКомпозитныеПробы</registerRecords>
  <registerRecords>InformationRegister.гкс_ФактическиеПоказателиКачества</registerRecords>
  <registerRecords>InformationRegister.гкс_ВнешниеПробыРегистрации</registerRecords>
  <attributes>
    <name>ВидЛабораторногоАнализа</name>
    <type>
      <types>CatalogRef.гкс_ВидыЛабораторногоАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбразцов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВнешний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.гкс_СтатусыЛабораторногоАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      <types>DocumentRef.гкс_ФормированиеНомераПробы</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НазначениеИспользованияКачества</name>
    <comment>ERP-2184</comment>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ВидПеревозки</name>
    <comment>ERP-2184</comment>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаПолученияАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаНачалаАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаОкончанияАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СостояниеТранспортногоСредства</name>
    <type>
      <types>EnumRef.гкс_СоответствиеТребованиям</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодУрожая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативнаяСертификация</name>
    <type>
      <types>DocumentRef.гкс_НормативнаяСертификацияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаПеревозку</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КачественныеПоказатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СоответствуетНормативу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтклонениеОтБазиса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>гкс_Примечание</name>
      <comment>ERP-1475</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийСоотвествия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсиленныйКонтроль</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтклонятьКачество</name>
      <comment>При отклонении от нормы - отклонять качество</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоЗначениеВнешнейПробы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИскатьВнешниеПробы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешняяПроба</name>
      <type>
        <types>DocumentRef.гкс_ВнешняяПроба</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольнаяСуммаВнешнейПробы</name>
      <comment>Контрольная сумма MD5</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиДляПерепроверки</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеИспользованияКачества</name>
      <type>
        <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/CommonModules/гкс_ПриемкаТранспортаСлужебный/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьОтборТочкаМаршрута(Форма) Экспорт
	
	ИспользоватьНесколькоАЛЦ = ПолучитьФункциональнуюОпцию("гкс_ИспользоватьНесколькоАЛЦ");
	Элементы = Форма.Элементы;
	Элементы.ОтборТочкаМаршрута.Доступность = ИспользоватьНесколькоАЛЦ;
	Элементы.ОтборТочкаМаршрута.РежимВыбораИзСписка = ИспользоватьНесколькоАЛЦ;
	
	АЛЦПользователя = Новый Массив;
	Форма.ОтборТочкаМаршрута = 
		гкс_ПриемкаТранспорта.ПЛКизНастроекБазыПользователя(ИспользоватьНесколькоАЛЦ, АЛЦПользователя);
	Если ИспользоватьНесколькоАЛЦ
		И ЗначениеЗаполнено(АЛЦПользователя) Тогда
		
		СписокВыбора = Элементы.ОтборТочкаМаршрута.СписокВыбора;
		СписокВыбора.ЗагрузитьЗначения(АЛЦПользователя);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьСтруктуруДоступов(Форма) Экспорт
	
	Если ЗначениеЗаполнено(Форма.ОтборТочкаМаршрута) И ЗначениеЗаполнено(Форма.ОтборВидПеревозки) Тогда
		Форма.СтруктураДоступов = ПолучитьСтруктуруДоступовНаСервере(Форма, Истина);
	Иначе
		Форма.СтруктураДоступов = ПолучитьСтруктуруДоступовНаСервере(Форма, Ложь);
	КонецЕсли;
		
КонецПроцедуры

Процедура ИнициализироватьРеквизитыПравПользователя(Форма) Экспорт
	
	Форма.ЕстьПравоНаРедактированиеРегистрации 	= ПравоНаРедактированияРегистрации(Форма.СтруктураДоступов);
	Форма.ЕстьПравоНаРедактированиеВзвешивания 	= ЕстьПравоНаРедактирование("гкс_Взвешивание");
	Форма.ЕстьПравоНаРедактированиеНомераПробы 	= ЕстьПравоНаРедактирование("гкс_ФормированиеНомераПробы");
	Форма.ЕстьПравоНаРедактированиеЛабАнализа 	= ЕстьПравоНаРедактирование("гкс_ЛабораторныйАнализ");
	Форма.ЕстьПравоНаРедактированиеНаправленияНаРазгрузку = ЕстьПравоНаРедактирование("гкс_НаправлениеНаРазгрузку");
	Форма.ЕстьПравоНаРедактированиеПриемкаТранспортаБезВходногоКонтроля 
		= ПравоДоступа("Изменение", Метаданные.РегистрыСведений["гкс_ПриемкаТранспортаБезВходногоКонтроля"]);
	
КонецПроцедуры

Процедура ОбновитьНаправленияРазгрузки(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	Пока Элементы.ГруппаНаправленияРазгрузкиЭлементы.ПодчиненныеЭлементы.Количество() > 0 Цикл
		Элементы.Удалить(Элементы.ГруппаНаправленияРазгрузкиЭлементы.ПодчиненныеЭлементы.Получить(0));
	КонецЦикла;
	
	// Новые группы для вывода декораций
	СвойстваГруппы = Новый Структура;
	СвойстваГруппы.Вставить("Вид", ВидГруппыФормы.ОбычнаяГруппа);
    СвойстваГруппы.Вставить("ОтображатьЗаголовок", Ложь);
	СвойстваГруппы.Вставить("Объединенная", Истина);
	СвойстваГруппы.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	
	ГруппаНаправленияРазгрузкиЭлементыЛево = Элементы.Добавить(
		"ГруппаНаправленияРазгрузкиЭлементыЛево", Тип("ГруппаФормы"), Элементы.ГруппаНаправленияРазгрузкиЭлементы);
	ЗаполнитьЗначенияСвойств(ГруппаНаправленияРазгрузкиЭлементыЛево, СвойстваГруппы);	
	
	ГруппаНаправленияРазгрузкиЭлементыПраво = Элементы.Добавить(
		"ГруппаНаправленияРазгрузкиЭлементыПраво", Тип("ГруппаФормы"), Элементы.ГруппаНаправленияРазгрузкиЭлементы);
	ЗаполнитьЗначенияСвойств(ГруппаНаправленияРазгрузкиЭлементыПраво, СвойстваГруппы);
	
	// Создание декораций
	ВывестиВЛевуюГруппу = Истина;
	НаправленияРазгрузки = НаправленияРазгрузкиПоВидуПеревозки(Форма.ОтборТочкаМаршрута, Форма.ОтборВидПеревозки);
	Для Каждого КлючЗначение Из НаправленияРазгрузки Цикл
		
		ТекущаяГруппа = ?(ВывестиВЛевуюГруппу, 
			ГруппаНаправленияРазгрузкиЭлементыЛево, ГруппаНаправленияРазгрузкиЭлементыПраво);
		ВывестиВЛевуюГруппу = Не ВывестиВЛевуюГруппу;
		СформироватьЭлементИнформацияНаправленияРазгрузки(Элементы, ТекущаяГруппа,
			ПредставлениеНаправленияРазгрузкиПоНоменклатуре(НаправленияРазгрузки, КлючЗначение.Ключ));
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ИнициализироватьЗначенияДетальныхЗаписей(Форма) Экспорт
	
	Форма.ВесНетто 			= 0;
	Форма.ВесРазница 		= 0;
	Форма.ВесНаВъезде		= 0;
	Форма.ВесНаВыезде		= 0;
	Форма.ВесПоДокументам	= 0;
	
	Форма.СкладПлан 				= Неопределено;
	Форма.НомерПробы 				= Неопределено;
	Форма.КомментарийРегистрации 	= Неопределено;
	Форма.ДатаРегистрацииАнализов	= Неопределено;
	Форма.ДатаДокументаПоставщика 	= Неопределено;
	Форма.ЗаявкаНаПеревозку 		= Неопределено;
    Форма.ТранспортноеСредство 		= Неопределено;
	Форма.Номенклатура		 		= Неопределено;
	
	ОчиститьИнформациюОБлокировке(Форма);
	
КонецПроцедуры

Процедура УстановитьОтборыСпискаВнешниеПробы(Форма)
	
	// изменить отбор списка внешних проб		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.СписокВнешниеПробы,
		"ВидПеревозки", Форма.ОтборВидПеревозки, ВидСравненияКомпоновкиДанных.Равно);	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.СписокВнешниеПробы,
		"Номенклатура", Форма.Номенклатура, ВидСравненияКомпоновкиДанных.Равно);
	
	Если ЗначениеЗаполнено(Форма.ЗаявкаНаПеревозку) Тогда
		НомерЗаявки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.ЗаявкаНаПеревозку, "Номер");	
	Иначе
		НомерЗаявки = "";
	КонецЕсли;
	
	Если Форма.ОтборВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль Тогда 
		НомерТС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.ТранспортноеСредство, "НомерТранспортногоСредства");
		НомераАвтоИПрицепа = гкс_ПриемкаТранспорта.НомерТранспортногоСредстваВСтруктуру(НомерТС); 
	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.СписокВнешниеПробы,
			"НомерЗерновоза", НомераАвтоИПрицепа.НомерЗерновоза, ВидСравненияКомпоновкиДанных.Равно);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.СписокВнешниеПробы,
			"ДатаПогрузки", Форма.ДатаДокументаПоставщика, ВидСравненияКомпоновкиДанных.Равно); 
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Форма.СписокВнешниеПробы, 
			"НомерЗаявки");
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Форма.СписокВнешниеПробы, 
			"ТранспортноеСредство");
		
	ИначеЕсли Форма.ОтборВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.СписокВнешниеПробы,
			"ТранспортноеСредство", Форма.ТранспортноеСредство, ВидСравненияКомпоновкиДанных.Равно);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.СписокВнешниеПробы,
			"НомерЗаявки", НомерЗаявки, ВидСравненияКомпоновкиДанных.Равно);  
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Форма.СписокВнешниеПробы, 
			"ДатаПогрузки");
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Форма.СписокВнешниеПробы, 
			"НомерЗерновоза");
	КонецЕсли;	
		
КонецПроцедуры

Процедура ТаблицаСписокПоказанийВесаЗаполнить(Форма) Экспорт
	
	Если Форма.ОтборТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка Тогда
		ВесРазницаБрутто	= Форма.ВесБруттоПоДокументам 	- Форма.ВесНаВъезде;
		ВесРазницаТара		= Форма.ВесТарыПоДокументам 	- Форма.ВесНаВыезде;
	Иначе
		ВесРазницаБрутто	= 0;
		ВесРазницаТара		= 0;
	КонецЕсли;
	
	Форма.ТаблицаСписокПоказанийВеса.Очистить();
	
	НоваяСтрока = Форма.ТаблицаСписокПоказанийВеса.Добавить();
	НоваяСтрока.ВидВеса			= "Брутто";
	НоваяСтрока.ПоДокументам	= Форма.ВесБруттоПоДокументам;
	НоваяСтрока.ПоВзвешиванию	= ?(Форма.ОтборТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка, 
									Форма.ВесНаВъезде, Форма.ВесНаВыезде);
	НоваяСтрока.РазницаВеса		= ВесРазницаБрутто;
	
	НоваяСтрока = Форма.ТаблицаСписокПоказанийВеса.Добавить();
	НоваяСтрока.ВидВеса			= "Тара";
	НоваяСтрока.ПоДокументам	= Форма.ВесТарыПоДокументам;
	НоваяСтрока.ПоВзвешиванию	= ?(Форма.ОтборТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка,
									Форма.ВесНаВыезде, Форма.ВесНаВъезде);
	НоваяСтрока.РазницаВеса		= ВесРазницаТара;
	
	НоваяСтрока = Форма.ТаблицаСписокПоказанийВеса.Добавить();
	НоваяСтрока.ВидВеса			= "Нетто";
	НоваяСтрока.ПоДокументам	= Форма.ВесПоДокументам;
	НоваяСтрока.ПоВзвешиванию	= Форма.ВесНетто;
	НоваяСтрока.РазницаВеса 	= Форма.ВесРазница;

КонецПроцедуры

Процедура РедактироватьПриемкуНаСервере(ПараметрыРедактирования, ДокументРегистрации, ДанныеРегистрации) Экспорт
	
	Если ПараметрыРедактирования.АвтоматическоеФормированиеДокументов Тогда
		СформироватьКомплектДокументовПриемкиИЗарегистрироватьУбытиеТранспорта(
			ДокументРегистрации, ДанныеРегистрации);
	Иначе
		ЗарегистрироватьНовоеСостояние(
			ПредопределенноеЗначение("Перечисление.гкс_СостоянияРегистрации.Убыл"), ДокументРегистрации);
	КонецЕсли;
	
	Если Не ЭтоПриемкаТранспорта(ПараметрыРедактирования.ОтборТипРегистрации) Тогда
		ЗаписатьСообщениеОтгрузкаАвтотранспортомВОчередьОповещений(ДокументРегистрации);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДетальныеЗаписиРегистрацииНаСервере(Форма, ТекущиеДанные) Экспорт
	
	ИнициализироватьЗначенияДетальныхЗаписей(Форма);
	
	ДокументРегистрации 			= ТекущиеДанные.ДокументРегистрации;
	ДокументРегистрацииАнализов 	= ТекущиеДанные.ДокументРегистрацииАнализов;
	Форма.НомерПробы 				= ТекущиеДанные.НомерПробы;
	Форма.СкладПлан 				= ТекущиеДанные.СкладПлан;
	Форма.КомментарийРегистрации 	= ТекущиеДанные.Комментарий;
	
	Если Форма.ОтборТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка Тогда
		Форма.ВесНаВъезде	= ТекущиеДанные.ВесБрутто;
		Форма.ВесНаВыезде	= ТекущиеДанные.ВесТары;
		Форма.ВесНетто		= Форма.ВесНаВъезде 			- Форма.ВесНаВыезде;
		Форма.ВесРазница	= Форма.ВесНетто 				- Форма.ВесПоДокументам;
	Иначе	
		Форма.ВесНаВыезде 	= ТекущиеДанные.ВесБрутто;
		Форма.ВесНаВъезде	= ТекущиеДанные.ВесТары;
		Форма.ВесНетто		= Форма.ВесНаВыезде 			- Форма.ВесНаВъезде;
		Форма.ВесРазница	= 0;
	КонецЕсли;
				
	ДанныеДляДетальныхЗаписей = Обработки.гкс_ПриемкаТранспорта
		.ДанныеДляДетальныхЗаписей(ДокументРегистрации, ДокументРегистрацииАнализов);
	
	ЗаполнитьЗначенияСвойств(Форма, ДанныеДляДетальныхЗаписей.ДанныеРегистрации);
	ЗаполнитьЗначенияСвойств(Форма, ДанныеДляДетальныхЗаписей, "ТранспортныйДокумент, ЗаявкаНаПеревозку");
	
	Форма.КачественныеПоказатели.Очистить();
	Форма.КачественныеПоказатели.Загрузить(ДанныеДляДетальныхЗаписей.КачественныеПоказатели);
	
	Если ЗначениеЗаполнено(ДокументРегистрацииАнализов) Тогда
		Форма.ДатаРегистрацииАнализов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРегистрацииАнализов, "Дата");
	КонецЕсли;
	
	Форма.ВесБруттоПоДокументам = ДанныеДляДетальныхЗаписей.ДанныеРегистрации.ВесБруттоПоДокументам;
	Форма.ВесТарыПоДокументам = ДанныеДляДетальныхЗаписей.ДанныеРегистрации.ВесТарыПоДокументам;
	
	ТаблицаСписокПоказанийВесаЗаполнить(Форма);
	УстановитьОтборыСпискаВнешниеПробы(Форма);
	ЗаполнитьИнформациюОБлокировке(Форма, ДокументРегистрации, ДокументРегистрацииАнализов);
	
КонецПроцедуры

Функция СлужебнаяНоменклатураДляФормированияНаправленияНаРагрузку(ЛабораторныйАнализ) Экспорт
	
	Если ЗначениеЗаполнено(ЛабораторныйАнализ) Тогда
		
		РеквизитыАнализа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ЛабораторныйАнализ, "Дата, гкс_ДокументРегистрации");
		
		Возврат 
			гкс_ПриемкаТранспорта.ПодходящаяСлужебнаяНоменклатураДляФормированияНаправленияНаРагрузку(
				РеквизитыАнализа.Дата, РеквизитыАнализа.гкс_ДокументРегистрации, ЛабораторныйАнализ);
	Иначе
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Только для внутреннего использования
Функция ПолучитьСтруктуруДоступовНаСервере(Форма, НужноЗаполнять)
	
	Если НужноЗаполнять Тогда
		СтруктураДоступов = гкс_ПриемкаНаПЛКСервер.ПолучитьРолиНаПЛК(
			Форма.ОтборТочкаМаршрута, Форма.ОтборВидПеревозки, Форма.Пользователь, Форма.ЭтоПолноправныйПользователь);
	Иначе
		СтруктураДоступов = гкс_ПриемкаНаПЛКСервер.ИнициализироватьСтруктуруДоступовПриемкаПЛК();
	КонецЕсли;

	Возврат СтруктураДоступов;
	
КонецФункции

// Только для внутреннего использования
Функция ПравоНаРедактированияРегистрации(СтруктураДоступов)
	
	Возврат СтруктураДоступов.Свойство("ДоступенРегистрация")
			И СтруктураДоступов.ДоступенРегистрация 
			И ЕстьПравоНаРедактирование("гкс_РегистрацияНаПЛК");
	
КонецФункции

// Только для внутреннего использования
Функция ЕстьПравоНаРедактирование(ИмяОбъекта)
	
	Возврат ПравоДоступа("Добавление", Метаданные.Документы[ИмяОбъекта]);
	
КонецФункции

Процедура СформироватьКомплектДокументовПриемкиИЗарегистрироватьУбытиеТранспорта(ДокументРегистрации, ДанныеРегистрации)
	
	Менеджер = Обработки.гкс_ПриемкаТранспорта;
	Менеджер.СформироватьКомплектДокументовПриемкиИЗарегистрироватьУбытиеТранспорта(
		ДокументРегистрации, ДанныеРегистрации);

КонецПроцедуры

Процедура ЗарегистрироватьНовоеСостояние(НовоеСостояние, ДокументРегистрации, Комментарий = "")
	
	гкс_ПриемкаТранспорта.ЗарегистрироватьНовоеСостояние(ДокументРегистрации, НовоеСостояние, Комментарий);
	
КонецПроцедуры

Процедура ЗаписатьСообщениеОтгрузкаАвтотранспортомВОчередьОповещений(Источник)
	
	гкс_РассылкиИОповещения.ЗаписатьСообщениеОтгрузкаАвтотранспортомВОчередьОповещений(Источник);
	
КонецПроцедуры

Функция ЭтоПриемкаТранспорта(ТипРегистрации)
	
	Возврат ТипРегистрации = ПредопределенноеЗначение("Перечисление.гкс_ТипРегистрации.Приемка");
	
КонецФункции

#Область НастройкиНазначенияРазгрузки

Процедура СформироватьЭлементИнформацияНаправленияРазгрузки(Элементы, Родитель, Знач ТекстЭлемента)
	
	ШиринаЭлемента 		= 38;
	ВысотаКорректировка = 3;
	ВысотаЭлемента 		= Цел(СтрДлина(ТекстЭлемента) / ШиринаЭлемента) + ВысотаКорректировка;
	
	Ключ = "Ключ" + СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
	НовыйЭлемент = Элементы.Добавить(
		Ключ + "Надпись", Тип("ДекорацияФормы"), Родитель);
	НовыйЭлемент.Вид		= ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок 	= ТекстЭлемента;
	НовыйЭлемент.Рамка		= РамкиСтиля.РамкаЭлементаУправления;
	НовыйЭлемент.Ширина		= ШиринаЭлемента;
	НовыйЭлемент.Высота		= ВысотаЭлемента;
	НовыйЭлемент.ГоризонтальноеПоложение	= ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.ВертикальноеПоложение		= ВертикальноеПоложениеЭлемента.Центр;
	
КонецПроцедуры

Функция ПредставлениеНаправленияРазгрузкиПоНоменклатуре(НаправленияРазгрузки, Номенклатура)
	
	МассивСтрок	= Новый Массив;
	МассивСтрок.Добавить(
		Новый ФорматированнаяСтрока(Номенклатура + Символы.ПС, ШрифтыСтиля.гкс_ШрифтЗаголовкаНастройкиРазгрузки));
	ДанныеМассива = НаправленияРазгрузки.Получить(Номенклатура); 
	МассивПодстрок = Новый Массив;
	Для Каждого ЭлементМассива Из ДанныеМассива Цикл
		МассивПодстрок.Добавить(СтрШаблон("%1 - %2", ЭлементМассива.Силос, ЭлементМассива.СлужебнаяНоменклатура));
	КонецЦикла;
	
	МассивСтрок.Добавить(СтрСоединить(МассивПодстрок, Символы.ПС));
	
	Возврат Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецФункции

Функция НаправленияРазгрузкиПоВидуПеревозки(ТочкаМаршрута, ВидПеревозки)
	
	НаправленияРазгрузки = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидПеревозки", ВидПеревозки);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.Текст = ТекстЗапросаНаправленияРазгрузкиПоВидуПеревозки();
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда

		Выборка	= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка.Следующий() Цикл
			
			МассивСтрок 		= Новый Массив;
			ВыборкаДетальная 	= Выборка.Выбрать();
			Пока ВыборкаДетальная.Следующий() Цикл
				ДанныеОтображения = Новый Структура("Силос, СлужебнаяНоменклатура");
				ЗаполнитьЗначенияСвойств(ДанныеОтображения, ВыборкаДетальная);
				МассивСтрок.Добавить(ДанныеОтображения);
			КонецЦикла;
			
			НаправленияРазгрузки.Вставить(Выборка.Номенклатура, МассивСтрок);
			
		КонецЦикла;
		
	КонецЕсли;
		
	Возврат НаправленияРазгрузки;
	
КонецФункции

Функция ТекстЗапросаНаправленияРазгрузкиПоВидуПеревозки()
	
	Возврат 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НастройкиНазначенияРазгрузки.Номенклатура КАК Номенклатура,
	|	НастройкиНазначенияРазгрузки.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	НастройкиНазначенияРазгрузки.Силос КАК Силос
	|ПОМЕСТИТЬ НастройкиНазначенияРазгрузки
	|ИЗ
	|	РегистрСведений.гкс_НастройкиНазначенияРазгрузки.СрезПоследних(, ТочкаМаршрута = &ТочкаМаршрута
	|	И ВидПеревозки = &ВидПеревозки) КАК НастройкиНазначенияРазгрузки
	|ГДЕ
	|	НастройкиНазначенияРазгрузки.Действует
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НастройкиНазначенияРазгрузки.Номенклатура,
	|	НастройкиНазначенияРазгрузки.СлужебнаяНоменклатура,
	|	НастройкиНазначенияРазгрузки.Силос
	|ИЗ
	|	РегистрСведений.гкс_ДополнительныеНастройкиНазначенияРазгрузки.СрезПоследних(, ТочкаМаршрута = &ТочкаМаршрута
	|	И ВидПеревозки = &ВидПеревозки) КАК НастройкиНазначенияРазгрузки
	|ГДЕ
	|	НастройкиНазначенияРазгрузки.Действует
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(НастройкиНазначенияРазгрузки.Номенклатура) КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(НастройкиНазначенияРазгрузки.СлужебнаяНоменклатура) КАК СлужебнаяНоменклатура,
	|	ПРЕДСТАВЛЕНИЕ(НастройкиНазначенияРазгрузки.Силос) КАК Силос
	|ИЗ
	|	НастройкиНазначенияРазгрузки КАК НастройкиНазначенияРазгрузки
	|ИТОГИ
	|ПО
	|	Номенклатура";
	
КонецФункции

#КонецОбласти

Процедура ЗаполнитьИнформациюОБлокировке(Форма, ДокументРегистрации, ДокументРегистрацииАнализов)
	
	Элементы = Форма.Элементы;
	Если Элементы.Найти("ГруппаИнформацияОБлокировке") = Неопределено 
		Или Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьЗаблокированныеТС") Тогда
		Возврат;
	КонецЕсли;

	ДанныеБлокировки = гкс_ВходнойКонтрольКачества.ПолучитьПричинуБлокировкиДляДеталей(ДокументРегистрации);

	Если ДанныеБлокировки.ЕстьБлокировка Тогда
		Элементы.ДекорацияТекстПричиныБлокировки.Заголовок = ДанныеБлокировки.ТекстПричины;
		Форма.ЛАБлокировки = ДанныеБлокировки.ЛабораторныйАнализ;
		Элементы.ЛАБлокировкиПоле.Видимость = ЗначениеЗаполнено(Форма.ЛАБлокировки);
		Элементы.ГруппаИнформацияОБлокировке.Видимость = Истина;
	Иначе
		Элементы.ГруппаИнформацияОБлокировке.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура ОчиститьИнформациюОБлокировке(Форма)
	
	Элементы = Форма.Элементы;
	Если Элементы.Найти("ГруппаИнформацияОБлокировке") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Элементы.ГруппаИнформацияОБлокировке.Видимость = Ложь;
	Элементы.ДекорацияТекстПричиныБлокировки.Заголовок = "";
	Форма.ЛАБлокировки = Документы.гкс_ЛабораторныйАнализ.ПустаяСсылка();

КонецПроцедуры

#КонецОбласти
